# Declarative Homebrew manifest for macOS bootstrap.
# Applied via `brew bundle --file=<repo>/Brewfile` from ./install.
# Safe to re-run; brew bundle is idempotent.

tap "homebrew/bundle"

# Shells & core CLI
brew "bash"
brew "bash-completion@2"

# Dotfile & tool management
brew "chezmoi"

# Editors & multiplexers
brew "neovim"
brew "tmux"

# Search / navigation
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# VCS
brew "git"

# Languages & runtimes
brew "fnm"
brew "go"
brew "node"
brew "python"

# Shell tooling
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "pre-commit"
brew "editorconfig-checker"

# Fonts
cask "font-hack-nerd-font"
